; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=290, out_folder=./training, instance_id=17, seed=2041, goal_proportion=0.03

(define (problem blocksworld-17)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 - object)
 (:init 
    (arm-empty)
    (clear b195)
    (on b195 b170)
    (on-table b170)
    (clear b228)
    (on b228 b142)
    (on b142 b64)
    (on b64 b37)
    (on b37 b169)
    (on-table b169)
    (clear b12)
    (on b12 b81)
    (on b81 b93)
    (on b93 b213)
    (on b213 b206)
    (on b206 b116)
    (on b116 b179)
    (on b179 b272)
    (on b272 b27)
    (on b27 b234)
    (on b234 b48)
    (on-table b48)
    (clear b115)
    (on b115 b183)
    (on b183 b82)
    (on b82 b107)
    (on b107 b217)
    (on-table b217)
    (clear b46)
    (on-table b46)
    (clear b273)
    (on b273 b84)
    (on b84 b227)
    (on-table b227)
    (clear b247)
    (on b247 b38)
    (on b38 b278)
    (on b278 b15)
    (on b15 b73)
    (on-table b73)
    (clear b17)
    (on b17 b162)
    (on-table b162)
    (clear b150)
    (on-table b150)
    (clear b2)
    (on-table b2)
    (clear b47)
    (on b47 b4)
    (on b4 b203)
    (on b203 b238)
    (on b238 b186)
    (on b186 b109)
    (on b109 b214)
    (on b214 b221)
    (on b221 b144)
    (on-table b144)
    (clear b108)
    (on b108 b248)
    (on-table b248)
    (clear b69)
    (on b69 b36)
    (on-table b36)
    (clear b100)
    (on-table b100)
    (clear b196)
    (on b196 b236)
    (on-table b236)
    (clear b171)
    (on b171 b240)
    (on b240 b151)
    (on b151 b265)
    (on b265 b164)
    (on b164 b25)
    (on b25 b113)
    (on-table b113)
    (clear b114)
    (on b114 b7)
    (on b7 b200)
    (on b200 b271)
    (on-table b271)
    (clear b31)
    (on-table b31)
    (clear b152)
    (on b152 b249)
    (on b249 b10)
    (on b10 b112)
    (on b112 b94)
    (on b94 b62)
    (on b62 b288)
    (on b288 b53)
    (on-table b53)
    (clear b83)
    (on b83 b72)
    (on-table b72)
    (clear b277)
    (on b277 b92)
    (on b92 b87)
    (on-table b87)
    (clear b1)
    (on b1 b283)
    (on-table b283)
    (clear b78)
    (on b78 b208)
    (on b208 b180)
    (on b180 b147)
    (on b147 b11)
    (on-table b11)
    (clear b253)
    (on b253 b244)
    (on b244 b274)
    (on b274 b191)
    (on-table b191)
    (clear b246)
    (on b246 b5)
    (on b5 b123)
    (on b123 b225)
    (on b225 b156)
    (on b156 b59)
    (on b59 b14)
    (on b14 b127)
    (on-table b127)
    (clear b77)
    (on b77 b168)
    (on b168 b222)
    (on b222 b261)
    (on-table b261)
    (clear b198)
    (on b198 b279)
    (on b279 b284)
    (on b284 b251)
    (on b251 b163)
    (on-table b163)
    (clear b60)
    (on b60 b270)
    (on b270 b117)
    (on-table b117)
    (clear b157)
    (on-table b157)
    (clear b210)
    (on b210 b223)
    (on-table b223)
    (clear b184)
    (on b184 b98)
    (on-table b98)
    (clear b128)
    (on b128 b241)
    (on-table b241)
    (clear b174)
    (on b174 b20)
    (on-table b20)
    (clear b52)
    (on b52 b50)
    (on b50 b290)
    (on b290 b6)
    (on b6 b160)
    (on-table b160)
    (clear b233)
    (on b233 b26)
    (on b26 b44)
    (on b44 b102)
    (on-table b102)
    (clear b212)
    (on b212 b266)
    (on-table b266)
    (clear b177)
    (on b177 b252)
    (on b252 b43)
    (on b43 b74)
    (on b74 b139)
    (on b139 b16)
    (on-table b16)
    (clear b65)
    (on b65 b99)
    (on b99 b202)
    (on-table b202)
    (clear b188)
    (on b188 b185)
    (on-table b185)
    (clear b63)
    (on b63 b209)
    (on b209 b121)
    (on b121 b224)
    (on b224 b267)
    (on b267 b86)
    (on-table b86)
    (clear b106)
    (on b106 b40)
    (on-table b40)
    (clear b71)
    (on b71 b193)
    (on-table b193)
    (clear b66)
    (on b66 b146)
    (on-table b146)
    (clear b220)
    (on b220 b96)
    (on b96 b242)
    (on-table b242)
    (clear b263)
    (on-table b263)
    (clear b161)
    (on b161 b21)
    (on-table b21)
    (clear b79)
    (on b79 b219)
    (on b219 b122)
    (on b122 b57)
    (on-table b57)
    (clear b178)
    (on b178 b120)
    (on b120 b125)
    (on b125 b262)
    (on b262 b33)
    (on b33 b134)
    (on b134 b245)
    (on-table b245)
    (clear b218)
    (on b218 b32)
    (on b32 b103)
    (on-table b103)
    (clear b39)
    (on b39 b182)
    (on-table b182)
    (clear b9)
    (on b9 b192)
    (on b192 b42)
    (on-table b42)
    (clear b54)
    (on b54 b101)
    (on b101 b91)
    (on b91 b190)
    (on b190 b135)
    (on b135 b230)
    (on b230 b145)
    (on b145 b155)
    (on-table b155)
    (clear b172)
    (on b172 b45)
    (on b45 b30)
    (on b30 b207)
    (on b207 b141)
    (on-table b141)
    (clear b254)
    (on b254 b110)
    (on b110 b232)
    (on b232 b173)
    (on b173 b281)
    (on b281 b138)
    (on b138 b211)
    (on b211 b276)
    (on b276 b143)
    (on b143 b88)
    (on-table b88)
    (clear b18)
    (on b18 b167)
    (on b167 b8)
    (on b8 b201)
    (on b201 b89)
    (on-table b89)
    (clear b148)
    (on b148 b158)
    (on b158 b243)
    (on-table b243)
    (clear b194)
    (on b194 b111)
    (on b111 b285)
    (on-table b285)
    (clear b289)
    (on b289 b275)
    (on b275 b149)
    (on-table b149)
    (clear b29)
    (on b29 b231)
    (on b231 b24)
    (on b24 b131)
    (on-table b131)
    (clear b35)
    (on-table b35)
    (clear b260)
    (on b260 b137)
    (on-table b137)
    (clear b250)
    (on b250 b204)
    (on b204 b268)
    (on b268 b187)
    (on b187 b85)
    (on b85 b19)
    (on-table b19)
    (clear b49)
    (on b49 b118)
    (on b118 b255)
    (on b255 b237)
    (on b237 b76)
    (on b76 b257)
    (on-table b257)
    (clear b259)
    (on b259 b130)
    (on b130 b68)
    (on b68 b90)
    (on b90 b189)
    (on b189 b13)
    (on b13 b239)
    (on b239 b197)
    (on b197 b256)
    (on b256 b28)
    (on b28 b80)
    (on-table b80)
    (clear b56)
    (on-table b56)
    (clear b286)
    (on b286 b55)
    (on b55 b34)
    (on b34 b216)
    (on b216 b3)
    (on b3 b287)
    (on-table b287)
    (clear b58)
    (on b58 b132)
    (on b132 b280)
    (on b280 b51)
    (on b51 b176)
    (on b176 b23)
    (on b23 b165)
    (on-table b165)
    (clear b282)
    (on b282 b104)
    (on b104 b181)
    (on-table b181)
    (clear b95)
    (on b95 b119)
    (on b119 b75)
    (on b75 b215)
    (on b215 b264)
    (on b264 b175)
    (on b175 b136)
    (on b136 b124)
    (on b124 b97)
    (on b97 b269)
    (on b269 b105)
    (on b105 b153)
    (on-table b153)
    (clear b140)
    (on b140 b226)
    (on b226 b258)
    (on-table b258)
    (clear b199)
    (on b199 b133)
    (on b133 b61)
    (on-table b61)
    (clear b154)
    (on b154 b166)
    (on b166 b205)
    (on b205 b129)
    (on-table b129)
    (clear b70)
    (on b70 b41)
    (on-table b41)
    (clear b126)
    (on-table b126)
    (clear b235)
    (on b235 b67)
    (on-table b67)
    (clear b159)
    (on b159 b229)
    (on b229 b22)
    (on-table b22))
 (:goal  (and 
    (clear b1)
    (on b1 b2)
    (on-table b2)
    (clear b4)
    (on b4 b5)
    (on b5 b8)
    (on b8 b7)
    (on b7 b6)
    (on b6 b3)
    (on-table b3))))

; plan
1. (unstack b114 b7)
   deleted: (on b114 b7) (clear b114) (arm-empty)
   added: (holding b114) (clear b7)
   goals met: 2 of 10
2. (putdown b114)
   deleted: (holding b114)
   added: (clear b114) (arm-empty) (on-table b114)
   goals met: 2 of 10
3. (unstack b18 b167)
   deleted: (on b18 b167) (clear b18) (arm-empty)
   added: (holding b18) (clear b167)
   goals met: 2 of 10
4. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 2 of 10
5. (unstack b167 b8)
   deleted: (on b167 b8) (clear b167) (arm-empty)
   added: (holding b167) (clear b8)
   goals met: 2 of 10
6. (putdown b167)
   deleted: (holding b167)
   added: (clear b167) (arm-empty) (on-table b167)
   goals met: 2 of 10
7. (unstack b246 b5)
   deleted: (on b246 b5) (clear b246) (arm-empty)
   added: (holding b246) (clear b5)
   goals met: 2 of 10
8. (putdown b246)
   deleted: (holding b246)
   added: (clear b246) (arm-empty) (on-table b246)
   goals met: 2 of 10
9. (unstack b286 b55)
   deleted: (on b286 b55) (clear b286) (arm-empty)
   added: (holding b286) (clear b55)
   goals met: 2 of 10
10. (putdown b286)
   deleted: (holding b286)
   added: (clear b286) (arm-empty) (on-table b286)
   goals met: 2 of 10
11. (unstack b47 b4)
   deleted: (on b47 b4) (clear b47) (arm-empty)
   added: (holding b47) (clear b4)
   goals met: 3 of 10
12. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 3 of 10
13. (unstack b52 b50)
   deleted: (on b52 b50) (clear b52) (arm-empty)
   added: (holding b52) (clear b50)
   goals met: 3 of 10
14. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 3 of 10
15. (unstack b50 b290)
   deleted: (on b50 b290) (clear b50) (arm-empty)
   added: (holding b50) (clear b290)
   goals met: 3 of 10
16. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 3 of 10
17. (unstack b290 b6)
   deleted: (on b290 b6) (clear b290) (arm-empty)
   added: (holding b290) (clear b6)
   goals met: 3 of 10
18. (putdown b290)
   deleted: (holding b290)
   added: (clear b290) (arm-empty) (on-table b290)
   goals met: 3 of 10
19. (unstack b55 b34)
   deleted: (on b55 b34) (clear b55) (arm-empty)
   added: (holding b55) (clear b34)
   goals met: 3 of 10
20. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 3 of 10
21. (unstack b34 b216)
   deleted: (on b34 b216) (clear b34) (arm-empty)
   added: (holding b34) (clear b216)
   goals met: 3 of 10
22. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 3 of 10
23. (unstack b216 b3)
   deleted: (on b216 b3) (clear b216) (arm-empty)
   added: (holding b216) (clear b3)
   goals met: 3 of 10
24. (putdown b216)
   deleted: (holding b216)
   added: (clear b216) (arm-empty) (on-table b216)
   goals met: 3 of 10
25. (unstack b3 b287)
   deleted: (on b3 b287) (clear b3) (arm-empty)
   added: (holding b3) (clear b287)
   goals met: 3 of 10
26. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 4 of 10
27. (unstack b5 b123)
   deleted: (on b5 b123) (clear b5) (arm-empty)
   added: (holding b5) (clear b123)
   goals met: 4 of 10
28. (stack b5 b8)
   deleted: (clear b8) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b8)
   goals met: 5 of 10
29. (unstack b6 b160)
   deleted: (on b6 b160) (clear b6) (arm-empty)
   added: (holding b6) (clear b160)
   goals met: 5 of 10
30. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 6 of 10
31. (unstack b7 b200)
   deleted: (on b7 b200) (clear b7) (arm-empty)
   added: (holding b7) (clear b200)
   goals met: 6 of 10
32. (stack b7 b6)
   deleted: (clear b6) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b6)
   goals met: 7 of 10
33. (unstack b1 b283)
   deleted: (on b1 b283) (clear b1) (arm-empty)
   added: (holding b1) (clear b283)
   goals met: 6 of 10
34. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 8 of 10
35. (unstack b5 b8)
   deleted: (on b5 b8) (clear b5) (arm-empty)
   added: (holding b5) (clear b8)
   goals met: 7 of 10
36. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 7 of 10
37. (unstack b8 b201)
   deleted: (on b8 b201) (clear b8) (arm-empty)
   added: (holding b8) (clear b201)
   goals met: 7 of 10
38. (stack b8 b7)
   deleted: (clear b7) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b7)
   goals met: 8 of 10
39. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 8 of 10
40. (stack b5 b8)
   deleted: (clear b8) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b8)
   goals met: 9 of 10
41. (unstack b4 b203)
   deleted: (on b4 b203) (clear b4) (arm-empty)
   added: (holding b4) (clear b203)
   goals met: 8 of 10
42. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 10 of 10
